#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`
<details><summary>Show Plan</summary>
```

terraform
azurerm_resource_group.default: Refreshing state... [id=/subscriptions/8b956240-12c7-4e8e-b328-958fb0a78713/resourceGroups/efit-web-develop-rg]
data.azurerm_kubernetes_cluster.aks: Reading...
azurerm_public_ip.lb-pip: Refreshing state... [id=/subscriptions/8b956240-12c7-4e8e-b328-958fb0a78713/resourceGroups/efit-web-develop-rg/providers/Microsoft.Network/publicIPAddresses/efit-web-develop-pip]
data.azurerm_kubernetes_cluster.aks: Read complete after 1s [id=/subscriptions/8b956240-12c7-4e8e-b328-958fb0a78713/resourceGroups/efit-aks-rg/providers/Microsoft.ContainerService/managedClusters/efit-aks]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_public_ip.lb-pip has changed
  ~ resource "azurerm_public_ip" "lb-pip" {
        id                      = "/subscriptions/8b956240-12c7-4e8e-b328-958fb0a78713/resourceGroups/efit-web-develop-rg/providers/Microsoft.Network/publicIPAddresses/efit-web-develop-pip"
      ~ ip_address              = "13.90.59.34" -> "4.236.140.119"
        name                    = "efit-web-develop-pip"
        tags                    = {}
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # azurerm_dns_zone.default will be created
  + resource "azurerm_dns_zone" "default" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "efit-web.site"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "efit-web-default-rg"
    }

  # azurerm_public_ip.lb-pip must be replaced
-/+ resource "azurerm_public_ip" "lb-pip" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/8b956240-12c7-4e8e-b328-958fb0a78713/resourceGroups/efit-web-develop-rg/providers/Microsoft.Network/publicIPAddresses/efit-web-develop-pip" -> (known after apply)
      ~ ip_address              = "4.236.140.119" -> (known after apply)
      - ip_tags                 = {} -> null
      ~ name                    = "efit-web-develop-pip" -> "efit-web-default-pip" # forces replacement
      ~ resource_group_name     = "efit-web-develop-rg" -> "efit-web-default-rg" # forces replacement
      - tags                    = {} -> null
      - zones                   = [] -> null
        # (8 unchanged attributes hidden)
    }

  # azurerm_resource_group.default must be replaced
-/+ resource "azurerm_resource_group" "default" {
      ~ id         = "/subscriptions/8b956240-12c7-4e8e-b328-958fb0a78713/resourceGroups/efit-web-develop-rg" -> (known after apply)
      ~ name       = "efit-web-develop-rg" -> "efit-web-default-rg" # forces replacement
        tags       = {
            "type" = "webapp"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.aks_network_contributor will be created
  + resource "azurerm_role_assignment" "aks_network_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a2ee4d30-6da2-4760-aeb9-7886b43264f3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.dns_contributor will be created
  + resource "azurerm_role_assignment" "dns_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "64a89a5f-9479-4dad-baea-21a53713e2d2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 5 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + aks_network_contributor_map = {
      + name         = (known after apply)
      + principal_id = "a2ee4d30-6da2-4760-aeb9-7886b43264f3"
      + scope        = (known after apply)
    }
  + dns_contributor_map         = {
      + name         = (known after apply)
      + principal_id = "64a89a5f-9479-4dad-baea-21a53713e2d2"
      + scope        = (known after apply)
    }
  + ip_address                  = (known after apply)
  + ns_servers                  = (known after apply)

```
</details>
*Pushed by: @Jabronious, Action: `pull_request`*